export const recommendationState = {
  [-1]: 'Не рекомендовано на бюджет',
  0: '',
  1: 'На загальних умовах',
  2: 'За результатами співбесіди',
  11: 'За квотою 1',
  12: 'За квотою 2',
  13: 'За квотою 3',
  14: 'За квотою 4',
  21: 'За квотою для іноземців',
} as const

export const statusState = {
  /**
   * Заяву прийнято закладом вищої освіти до розгляду.
   * Приймається рішення про допуск вступника до участі в конкурсному відборі
   * */
  0: 'Зареєстровано',

  /**
   * Заява надійшла до навчального закладу,
   * але ще не перевірена приймальною комісією
   * */
  1: 'Заява надійшла з сайту',

  /**
   * Електронну заяву прийнято закладом вищої освіти до розгляду,
   * але дані стосовно вступника потребують уточнення
   * */
  2: 'Затримано',

  /** */
  3: 'Скасовано вступником',

  /**
   * Електронна заява вважається такою, що не подавалась.
   * Вступник не має права подання нової заяви з такою самою пріоритетністю
   * */
  4: 'Скасовано (втрата пріор.)',

  /** */
  5: 'Зареєстровано',

  /**
   * Абітурієнта допущено до участі у конкурсі на бюджет або контракт
   * */
  6: 'Допущено',

  /**
   * Абітурієнта не допущено до участі у конкурсному відборі
   * на підставі рішення приймальної комісії
   * */
  7: 'Відмова',

  /** */
  8: 'Скасовано ЗО',

  /**
   * Абітурієнта рекомендовано до зарахування на бюджет
   * */
  9: 'Рекомендовано (бюджет)',

  /** */
  10: 'Відхилено (бюджет)',

  /** */
  11: 'Допущено (контракт, за ріш. ПК)',

  /**
   * Абітурієнта рекомендовано до зарахування на контракт
   * */
  12: 'Рекомендовано (контракт)',

  /** */
  13: 'Відхилено (контракт)',

  /**
   * Абітурієнта зараховано на бюджет чи контракт
   * */
  14: 'До наказу',

  /** */
  15: 'Відраховано',

  /** */
  16: 'Скасовано (зарах. на бюджет)',
} as const

interface Rss {
  /** Коефіцієнти */
  f?: string

  /** Предмет */
  id?: number

  /** Показник */
  kv: string

  /** Спеціальні умови участі */
  sn?:
    | 'Квота 1'
    | 'Квота 1, Квота 2'
    | 'Квота 1, Квота 3'
    | 'Квота 1, Квота 4'
    | 'Квота 1, Співбесіда'
    | 'Квота 2'
    | 'Квота 3'
    | 'Квота 4'
    | 'Співбесіда'

  /** */
  t?:
    | 'gk' /** Галузевий коефіцієнт */
    | 'ob' /** Бал за особливі успіхи */
    | 'pk' /** Першочерговий коефіцієнт */
    | 'q' /** Квота */
    | 'rk' /** Регіональний коефіцієнт */
    | 'sk' /** Сільський коефіцієнт */
}

interface UserBase {
  /** Тип рекомендації */
  artid: keyof typeof recommendationState

  /** Подано оригінали документів */
  d: 0 | 1

  /** ПІБ */
  fio: string

  /** # */
  n: number

  /** */
  offer: number

  /** Бажана приорітетність */
  p: 0 | 1 | 2 | 3 | 4 | 5 | 'Б' | 'K'

  /** Рекомендовано за приорітетом */
  pa: 0 | 1 | 2 | 3 | 4 | 5

  /** */
  prid: number

  /** Статус */
  prsid: keyof typeof statusState

  /** Сплата */
  ptid: 0 | 1 /** бюджет */ | 2 /** контракт */

  /** Предмети */
  rss: Rss[]
}

interface UserWithTextScore extends UserBase {
  /** Конкурсний бал, text */
  kv: number

  /** Конкурсний бал, base64 */
  kvi?: never
}

interface UserWithImageScore extends UserBase {
  /** Конкурсний бал, text */
  kv?: never

  /** Конкурсний бал, base64 */
  kvi: string
}

export type User = UserWithTextScore | UserWithImageScore
